#+TITLE: FUNCTIONS - SPECIAL TOPICS
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE:DSC205 Introduction to Advanced Data Science
#+STARTUP:overview hideblocks indent
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:R :exports both :results output :session *R* :noweb yes
* Externally defined helper function

- Here is a new version of ~mult2~ (post-multiplication of matrices in a
  list with an argument matrix and with default string arguments):
  #+name: helper
  #+begin_src R
    helper <- function (x, matrix.flags, mat) {
      indices <- which(matrix.flags)
      counter <- 0
      result <- list()
      for (i in indices) {
        temp <- x[[i]]
        if (ncol(temp) == nrow(mat)) {
          counter <- counter + 1
          result[[counter]] <- temp %*% mat
        }
      }
      return (list(result,counter))
    }
  #+end_src

- We have isolated the core computation for the matrices (if there are
  any) including the compability check in another function definition.

- The original function is a lot shorter now, but it contains a call
  to the helper function:
  #+name: mult4
  #+begin_src R
    mult4 <- function (x, mat, str1="no matrix", str2="no valid matrix") {
      matrix.flags <- sapply(X=x, FUN=is.matrix)
      if (!any(matrix.flags)) return(str1)  # no matrices at all
      helper.call <- helper(x,matrix.flags,mat) # heavy lifting here
      result <- helper.call[[1]]
      counter <- helper.call[[2]]
      if (counter==0) return(str2) # no valid matrices
      return(result)
    }
  #+end_src

  #+RESULTS: mult4

- Test the code:
  #+begin_src R
    <<matrices>>
    <<helper>>
    <<mult4>>
    mult4(foo,diag(2)) # foo had two valid matrices (for multiplication)
    mult4(bar,diag(2)) # bar had no matrices at all
    mult4(baz,diag(2)) # baz had no valid matrix
  #+end_src

  #+RESULTS:
  #+begin_example
  [[1]]
       [,1] [,2]
  [1,]    1    3
  [2,]    2    4

  [[2]]
       [,1] [,2]
  [1,]    1    5
  [2,]    2    6
  [3,]    3    7
  [4,]    4    8
  [1] "no matrix"
  [1] "no valid matrix"
  #+end_example

- Check the global environment for all functions:
  #+begin_src R
    ls()
    search()
  #+end_src

  #+RESULTS:
  :  [1] "api_key"     "ask_chatgpt" "bar"         "baz"         "counter"
  :  [6] "fibseq"      "foo"         "helper"      "mult4"       "myfibplot"
  : [11] "myfibplot_"  "unpackme"
  :  [1] ".GlobalEnv"        "ESSR"              "package:stats"
  :  [4] "package:graphics"  "package:grDevices" "package:utils"
  :  [7] "package:datasets"  "package:stringr"   "package:httr"
  : [10] "package:methods"   "Autoloads"         "package:base"

* Disposable (anonymous) functions

- Disposable functions perform a simple, one-line task.

- ~apply~ is often used that way (with a simple ~FUN~ argument).

- Example: you want to repeat the columns of a ~numeric~ 3 x 4 ~matrix~
  twice and then ~sort~ its values:
  #+begin_src R
    foo <- matrix (c(2,3,3,4,2,4,7,3,3,6,7,2),3,4)
    foo
  #+end_src

- ~apply~ with ~MARGIN=2~ applies a function to every column of its target
  data. The anonymous (i.e. non-named) function is defined inside ~FUN~:
  #+begin_src R
    apply(X = foo, MARGIN = 2,
          FUN = function(x) { sort(rep(x,2))})
  #+end_src

  #+RESULTS:
  :      [,1] [,2] [,3] [,4]
  : [1,]    2    2    3    2
  : [2,]    2    2    3    2
  : [3,]    3    4    3    6
  : [4,]    3    4    3    6
  : [5,]    3    4    7    7
  : [6,]    3    4    7    7

- If we only had one function to perform (e.g. ~sort~), there would have
  been no need for the anonymous function but as soon as we want to
  nest functions, we need it.

- ~apply~ with ~sort~ alone:
  #+begin_src R
    apply(X = foo, MARGIN = 2,
          FUN = sort)
  #+end_src

- Now with ~rep~ nested inside ~sort~: error!
  #+begin_src R
    apply(X = foo, MARGIN = 2,
          FUN = sort(rep(foo,2)))
  #+end_src

** External helper for ~hello~
1) Write an external helper function ~hello_ext~ that takes an
   argument ~x~ and returns ~paste("Hello,",x)~
2) Write a function ~hello~ that takes an argument ~name~ with default
   value "world", calls the helper function on ~name~ and prints its
   return value.
3) Test the function both with and without an argument.
   #+begin_src R
     ## hello_ext takes x and returns string "hello x"
     hello_ext <- function(x) {
       return(paste("Hello,", x))
     }
     ## hello world with external helper call
     hello <- function(name="world") {
       return(hello_ext(name))
     }
     ## make the call with and without your name as argument
     hello()
     hello("Marcus")
   #+end_src

   #+RESULTS:
   : [1] "Hello, world"
   : [1] "Hello, Marcus"

** Recursive Fibonacci
- Call it for the argument values 1 through 10 and print the result:
  #+begin_src R
    <<recursive_fibonacci>>
    for (i in 1:10)
      print(fibo(i))
    sapply(1:10,fibo)
  #+end_src

  #+RESULTS:
  #+begin_example
  [1] 1
  [1] 1
  [1] 2
  [1] 3
  [1] 5
  [1] 8
  [1] 13
  [1] 21
  [1] 34
  [1] 55
   [1]  1  1  2  3  5  8 13 21 34 55
  #+end_example

** Example: ~warning~ and error ~stop~

- Test ~warn_test~ for x = -1, 0, 1, 5 using ~sapply~:
  #+begin_src R
    <<warn_test>>
    sapply(X=c(-1,0,1,5,10), FUN=warn_test)
  #+end_src

  #+RESULTS:
  : [1] 5.0 5.0 5.0 1.0 0.5
  : Warning messages:
  : 1: In FUN(X[[i]], ...) : Argument -1 <= 0 - setting it to 1 and continuing
  : 2: In FUN(X[[i]], ...) : Argument 0 <= 0 - setting it to 1 and continuing

- Test ~error_test~ for x = 10,5,0,-1 using ~sapply~:
  #+begin_src R
    <<error_test>>
    sapply(X=c(10,5,0,-1), FUN=error_test)
  #+end_src

  #+RESULTS:
  : Error in FUN(X[[i]], ...) : Argument 0 <=0 - TERMINATING

** Making Fibonacci safe
- Add ~warning~ and ~stop~ commands:
  #+name: fibo_safe_
  #+begin_src R :results silent
    <<recursive_fibonacci>>
    fibo_safe_ <- function(n) {
      ## exception handling for values of n
      if (n<0) {
        warning("Did you mean ",n," to be > 0? I'll fix it")
        n * (-1) -> n
      } else if (n == 0) {
        stop("Cannot continue at n= ",n)
      }
      ## calling the external function
      return (fibo(n))
    }
  #+end_src

- Call ~fibo_safe~ on this range of values: -5,-1,5,10:
  #+begin_src R
    <<fibo_safe_>>
    sapply(c(-5,-1,5,10), fibo_safe_)
  #+end_src

  #+RESULTS:
  : [1]  5  1  5 55
  : Warning messages:
  : 1: In FUN(X[[i]], ...) : Did you mean -5 to be > 0? I'll fix it
  : 2: In FUN(X[[i]], ...) : Did you mean -1 to be > 0? I'll fix it

- Call ~fibo_safe~ on 0:
  #+begin_src R
    <<fibo_safe_>>
    fibo_safe_(0)
  #+end_src

  #+RESULTS:
  : Error in fibo_safe_(0) : Cannot continue at n= 0
